app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE (created_at >='2016-01-27 00:00:00.000000')
SELECT "authors".* FROM "authors"
---
  def index
    @posts = Post.all
    @authors = Author.all

SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = 8
---
def index
  # provide a list of authors to the view for the filter control
  @authors = Author.all

  # filter the @posts list based on user input
  if !params[:author].blank?
    @posts = Post.by_author(params[:author])
  elsif !params[:date].blank?
  elsif !params[:date].blank?
    if params[:date] == "Today"
      @posts = Post.where("created_at >=?", Time.zone.today.beginning_of_day)